Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_comp.c
/** @defgroup COMP_Exported_Functions COMP Exported Functions
  * @{
  */

/** @defgroup COMP_Exported_Functions_Group1 Initialization/de-initialization functions
  *  @brief    Initialization and de-initialization functions.
  *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This section provides functions to initialize and de-initialize comparators

@endverbatim
  * @{
  */
/**
  * @brief  Initialize the COMP according to the specified
  *         parameters in the COMP_InitTypeDef and initialize the associated handle.
  * @note   If the selected comparator is locked, initialization can't be performed.
  *         To unlock the configuration, perform a system reset.
  * @param  hcomp  COMP handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_COMP_Init(COMP_HandleTypeDef *hcomp)
{
  uint32_t tmp_csr;
  __IO uint32_t tempdata = 0;
  uint32_t exti_line;
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the COMP handle allocation and lock status */
  if(hcomp == NULL)
  {
    status = HAL_ERROR;
  }
  else if(__HAL_COMP_IS_LOCKED(hcomp))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check the parameters */
    assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));
    assert_param(IS_COMP_WINDOWMODE(hcomp->Init.WindowMode));
    assert_param(IS_COMP_POWERMODE(hcomp->Init.Mode));
    assert_param(IS_COMP_INPUT_PLUS(hcomp->Instance, hcomp->Init.InputPlus));
    assert_param(IS_COMP_INPUT_MINUS(hcomp->Instance, hcomp->Init.InputMinus));
    assert_param(IS_COMP_VREFSRC(hcomp->Init.VrefSrc));
    assert_param(IS_COMP_VREFDIV(hcomp->Init.VrefDiv));
    assert_param(IS_COMP_HYSTERESIS(hcomp->Init.Hysteresis));
    assert_param(IS_COMP_OUTPUTPOL(hcomp->Init.OutputPol));
    assert_param(IS_COMP_BLANKINGSRCE(hcomp->Init.BlankingSrce));    
    assert_param(IS_COMP_TIMANDEXTIOUTSEL(hcomp->Init.TimAndExtiOutSel));
    assert_param(IS_COMP_TRIGGERMODE(hcomp->Init.TriggerMode));

    if(hcomp->State == HAL_COMP_STATE_RESET)
    {
      /* Allocate lock resource and initialize it */
      hcomp->Lock = HAL_UNLOCKED;

      /* Set COMP error code to none */
      COMP_CLEAR_ERRORCODE(hcomp);


#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
      /* Init the COMP Callback settings */
      hcomp->TriggerCallback = HAL_COMP_TriggerCallback; /* Legacy weak callback */

      if (hcomp->MspInitCallback == NULL)
      {
        hcomp->MspInitCallback = HAL_COMP_MspInit; /* Legacy weak MspInit  */
      }

      /* Init the low level hardware */
      /* Note: Internal control clock of the comparators must                 */
      /*       be enabled in "HAL_COMP_MspInit()"                             */
      /*       using "__HAL_RCC_SYSCFG_CLK_ENABLE()".                         */
      hcomp->MspInitCallback(hcomp);
#else
      /* Init the low level hardware */
      /* Note: Internal control clock of the comparators must                 */
      /*       be enabled in "HAL_COMP_MspInit()"                             */
      /*       using "__HAL_RCC_SYSCFG_CLK_ENABLE()".                         */
      HAL_COMP_MspInit(hcomp);
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
    }

  /* Set COMP parameters */
    tmp_csr = (  hcomp->Init.InputMinus
                 | hcomp->Init.InputPlus
                 | hcomp->Init.BlankingSrce
                 | hcomp->Init.OutputPol
                 | hcomp->Init.Mode
                 | hcomp->Init.TimAndExtiOutSel   
              );
    /* Set parameters in COMP register */
    /* Note: Update all bits except read-only, lock and enable bits */
    MODIFY_REG(hcomp->Instance->CSR,
               COMP_CSR_LOCK | COMP_CSR_COMP_OUT  | COMP_CSR_PWRMODE | COMP_CSR_BLANKSEL | COMP_CSR_TIM_EXTI_OUT_SEL |
               COMP_CSR_POLARITY | COMP_CSR_WINMODE | COMP_CSR_INPSEL |
               COMP_CSR_INNSEL | COMP_CSR_EN,
               tmp_csr
              );
    /* Set digital filter */
    if (hcomp->Init.DigitalFilter == 0)
    {
      /* Disable digital filter */
      CLEAR_BIT(hcomp->Instance->FR, COMP_FR_FLTEN);
    }
    else
    {
      WRITE_REG(hcomp->Instance->FR, (COMP_FR_FLTEN | ((hcomp->Init.DigitalFilter) << COMP_FR_FLTCNT_Pos)));
    }

    if(hcomp->Init.InputMinus == COMP_INPUT_MINUS_VREFCMP)
    {
      MODIFY_REG(COMP1->CSR,COMP_CSR_VSEL | COMP_CSR_VCSEL | COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV , hcomp->Init.VrefSrc | hcomp->Init.VrefDiv );
      if(hcomp->Init.VrefSrc != COMP_VREFCMP_SOURCE_VCC)
      {
        WRITE_REG(FLASH->KEYR, FLASH_KEY1);
        WRITE_REG(FLASH->KEYR, FLASH_KEY2);

        if (READ_BIT(FLASH->CR, FLASH_CR_LOCK) != 0U)
        {
          return HAL_ERROR;
        }

        WRITE_REG(FLASH->OPTKEYR, FLASH_OPTKEY1);
        WRITE_REG(FLASH->OPTKEYR, FLASH_OPTKEY2);

        if (READ_BIT(FLASH->CR, FLASH_CR_OPTLOCK) != 0U)
        {
          return HAL_ERROR;
        }
        *(uint32_t *)0x4002228C = 0x5D7F4051;
        *(uint32_t *)0x4002228C = 0x46CE2763;
        switch (hcomp->Init.VrefSrc)
        {
          case COMP_VREFCMP_SOURCE_VREFINT0P6V:
            tempdata = (((*(uint32_t *)0x40022208) & 0xFFE0FFFF) | (((*(uint32_t *)0x1FFF76C0) << 16) & 0x1F0000));
            *(uint32_t *)0x40022208 = tempdata;
            break;

          case COMP_VREFCMP_SOURCE_VREFINT1P5V:
             tempdata = (((*(uint32_t *)0x40022208) & 0xFFE0FFFF) | (((*(uint32_t *)0x1FFF76C4) << 16) & 0x1F0000));
             *(uint32_t *)0x40022208 = tempdata;
            break;

          case COMP_VREFCMP_SOURCE_VREFINT2P048V:
             tempdata = (((*(uint32_t *)0x40022208) & 0xFFE0FFFF) | (((*(uint32_t *)0x1FFF76C8) << 16) & 0x1F0000));
             *(uint32_t *)0x40022208 = tempdata;
            break;

          default:
             tempdata = (((*(uint32_t *)0x40022208) & 0xFFE0FFFF) | (((*(uint32_t *)0x1FFF76CC) << 16) & 0x1F0000));
             *(uint32_t *)0x40022208 = tempdata;
            break;
        }
        SET_BIT(FLASH->CR, FLASH_CR_LOCK);
      }
    }
      
    /* Set Hysteresis */ 
    if(hcomp->Init.Hysteresis == COMP_HYSTERESIS_ENABLE)
    {      
      if(hcomp->Instance == COMP1)
      {
        SET_BIT(hcomp->Instance->CSR,COMP1_CSR_HYST);
      }
      else if (hcomp->Instance == COMP2)
      {
        SET_BIT(hcomp->Instance->CSR,COMP2_CSR_HYST);
      }
      else if (hcomp->Instance == COMP3)
      {
        SET_BIT(hcomp->Instance->CSR,COMP3_CSR_HYST);
      }
      else if (hcomp->Instance == COMP4)
      {
        SET_BIT(hcomp->Instance->CSR,COMP4_CSR_HYST);
      }
      else
      {
        
